ELPasEDT/src/Documents/РасходРеагента/РасходРеагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходРеагента</name>
  <basedOn>Document.ПриходРеагента</basedOn>
  <registerRecords>AccumulationRegister.ИспользованиеРеагентов</registerRecords>
  <registerRecords>AccumulationRegister.РеагентыВПодразделениях</registerRecords>
  <attributes>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходаРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходРеагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписатьВЖурналУчетаРеагентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПриемаСмены</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Вахта</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеРасхода</name>
    <type>
      <types>CatalogRef.НаправленияРасходаРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВЖурнал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ELPasEDT/src/AccumulationRegisters/РеагентыВПодразделениях/РеагентыВПодразделениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РеагентыВПодразделениях</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМоногидратаВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходРеагента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ELPasEDT/src/AccumulationRegisters/ИспользованиеРеагентов/ИспользованиеРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИспользованиеРеагентов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМоногидратаВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемСработанного</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходаРеагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеРасхода</name>
    <type>
      <types>CatalogRef.НаправленияРасходаРеагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходРеагента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ELPasEDT/src/InformationRegisters/ПоследовательностьВводаОперацийРаботыХимцеха/ПоследовательностьВводаОперацийРаботыХимцеха.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоследовательностьВводаОперацийРаботыХимцеха</name>
  <resources>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииОборудованияХимцеха</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СвязаннаяОперацияДокумент</name>
    <type>
      <types>DocumentRef.ЗаписьЖурналаУчетаРеагентов</types>
      <types>DocumentRef.РасходРеагента</types>
    </type>
  </resources>
  <resources>
    <name>СвязаннаяОперацияНомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументПриемаСмены</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаписьЖурналаУчетаРеагентов</types>
      <types>DocumentRef.РасходРеагента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Catalogs/ВидыРасходаРеагентов/ВидыРасходаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРасходаРеагентов</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НаправленияРасхода</name>
    <attributes>
      <name>ВидРеагента</name>
      <type>
        <types>EnumRef.ВидыРеагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеРасхода</name>
      <type>
        <types>CatalogRef.НаправленияРасходаРеагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ELPasEDT/src/Documents/РасходРеагента/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗаписьОтменена Тогда
		Для Каждого Набор Из Движения Цикл
			Набор.Очистить();
			Набор.Записать();
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	ДатаРасхода = Дата;
	
	Организация = Подразделение.Организация;
	ДатаРасхода = Дата;
	
	Если ЗначениеЗаполнено(Партия) Тогда
		Реагент = Партия.Реагент;
	Иначе
		Реагент = Неопределено;
	КонецЕсли;
	
	КоличествоВБазовойЕдинице = Количество * Партия.ЕдиницаИзмеренияКоличества.Коэффициент;
	Расход = КоличествоВБазовойЕдинице * Партия.Концентрация / 100
		* Партия.ЕдиницаИзмеренияКонцентрации.Коэффициент;
		
	Если Партия.УчитыватьПлотностьПриРасчетеКоличества 
		И ЗначениеЗаполнено(Партия.Плотность) 
		И ЗначениеЗаполнено(Партия.ЕдиницаИзмеренияПлотности)
		И ЗначениеЗаполнено(Партия.ЕдиницаИзмеренияПлотности.Коэффициент) 
		Тогда
		
		КоличествоВБазовойЕдинице = КоличествоВБазовойЕдинице 
			* Партия.Плотность * Партия.ЕдиницаИзмеренияПлотности.Коэффициент;
			
		Расход = Расход
			* Партия.Плотность * Партия.ЕдиницаИзмеренияПлотности.Коэффициент;
			
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗаписьОтменена Тогда
		Для Каждого Набор Из Движения Цикл
			Набор.Очистить();
			Набор.Записать();
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	// регистр РеагентыВПодразделениях Расход
	//Движения.РеагентыВПодразделениях.Записывать = Истина;
	Движение = Движения.РеагентыВПодразделениях.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Партия = Партия;
	Движение.ВидРеагента = ВидРеагента;
	Движение.Реагент = Реагент;
	Движение.Подразделение = Подразделение;
	
	Движение.Количество = Количество;
	Движение.КоличествоВБазовойЕдинице = КоличествоВБазовойЕдинице;
	Движение.КоличествоМоногидратаВБазовойЕдинице = Расход;
	
	Движения.РеагентыВПодразделениях.Записать();
	
	Параметры = Новый Структура;
	Параметры.Вставить("Период",        Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Параметры.Вставить("ВидРеагента",   ВидРеагента);
	Параметры.Вставить("Партия",        Партия);
	Параметры.Вставить("Подразделение", Подразделение);
	Параметры.Вставить("Реагент",       Реагент);
	
	РегистрыНакопления.РеагентыВПодразделениях.ВыполнитьКонтрольОстатков(Параметры, Отказ);
	
	Если Не Отказ Тогда
		
		// регистр ИспользованиеРеагентов
		Движения.ИспользованиеРеагентов.Записывать = Истина;
		ДвижениеРегИспольз = Движения.ИспользованиеРеагентов.Добавить();
		ДвижениеРегИспольз.Период                  = Дата;
		ДвижениеРегИспольз.Организация             = Подразделение.Организация;
		ДвижениеРегИспольз.Подразделение           = Подразделение;
		ДвижениеРегИспольз.Оборудование            = Оборудование;
		ДвижениеРегИспольз.ВидРасхода              = ВидРасхода;
		ДвижениеРегИспольз.НаправлениеРасхода      = НаправлениеРасхода;
		ДвижениеРегИспольз.Партия                  = Партия;
		ДвижениеРегИспольз.Реагент                 = Реагент;
		ДвижениеРегИспольз.Количество                           = Движение.Количество;
		ДвижениеРегИспольз.КоличествоВБазовойЕдинице            = Движение.КоличествоВБазовойЕдинице;
		ДвижениеРегИспольз.КоличествоМоногидратаВБазовойЕдинице = Движение.КоличествоМоногидратаВБазовойЕдинице;
		ДвижениеРегИспольз.Сценарий = Справочники.СценарииПланирования.Факт;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
	Организация   = Подразделение.Организация;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходРеагента") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РеагентыВПодразделенияхОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.РеагентыВПодразделениях.Остатки(, Партия = &Партия) КАК РеагентыВПодразделенияхОстатки");
		Запрос.УстановитьПараметр("Партия", ДанныеЗаполнения.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
		
			// Заполнение шапки
			ВидРасхода    = Справочники.ВидыРасходаРеагентов.СписаниеОстатка;
			ВидРеагента   = ДанныеЗаполнения.ВидРеагента;
			Количество    = Выборка.КоличествоОстаток;
			Подразделение = ДанныеЗаполнения.Подразделение;
			Партия        = ДанныеЗаполнения.Ссылка;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Или ЗаписьОтменена Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПоследовательностьВводаОперацийРаботыХимцеха.Документ КАК Документ,
		|	ПоследовательностьВводаОперацийРаботыХимцеха.НомерОперации КАК НомерОперации
		|ИЗ
		|	РегистрСведений.ПоследовательностьВводаОперацийРаботыХимцеха КАК ПоследовательностьВводаОперацийРаботыХимцеха
		|ГДЕ
		|	ПоследовательностьВводаОперацийРаботыХимцеха.Документ = &Документ");
		Запрос.УстановитьПараметр("Документ", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			МЗ = РегистрыСведений.ПоследовательностьВводаОперацийРаботыХимцеха.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Выборка);
			МЗ.Удалить();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
